{
	"boardMembers": [
		{
			"position": "Chief Operating Officer",
			"location": "Dallas, TX",
			"name": "Aisha Habeeb",
			"image": "aishaH.png",
			"bio":
				"Aisha Habeeb, MSW, LCSWA, fights daily to bring awareness, advocate for, and uplift the urban community. As an experienced mentor and social worker, Aisha has extensive knowledge of effective strategies and tactics required for creating mentorship opportunities that benefit both mentees and volunteers. Aisha has spent more than five years building and expanding Save A Girl, Save A World, a multi generational mentoring program for women.</p><p>In June 2014, Aisha, alongside the Detroit Police Department 9th precinct, Osborn Neighborhood Alliance and Matrix Human Services, launched Jayvon Felton's Midnight Basketball & Boxing Male Leadership Program. This program utilizes the youth's interest in basketball and boxing to gain their attention and provide life skills.</p><p>Aisha works really hard at creating a village and support system to help the urban community to navigate life's challenges. Aisha recently relocated to Charlotte, NC where she supports several organizations that serve the needs of women, children, and community entrepreneurship. Since relocating, Aisha has worked extensively with the Salvation Army to combat homelessness and human trafficking. Aisha currently provides therapy services to adolescents based on the Treatment Alternatives for Sexualized Kids (TASK) model.</p><p>Her favorite quote is by Ralph Waldo Emerson and reads &quot;Do not go where the path may lead, go instead where there is no path and leave a trail&quot;. Aisha firmly believes life is a journey, often from one need, one problem, and one solution to another. She simply wants to be an intricate part of providing resources to help individuals understand their journey and make their journey a little easier."
		},
		{
			"name": "Sheila Coates",
			"image": "sheilaCoates.png",
			"location": "Dallas, TX",
			"bio":
				"Sheila Coates is a marketing and branding expert with a niche for creating memorable visual impressions!< br / >She has over 20 - years of entertainment marketing experience - as a senior executive - in the fields of: broadcasting, print and music.Sheila enjoys strategic marketing concepts that encompass all communication platforms.With excellence in creating innovative campaigns that adhere to budget guidelines but exceed companies expectations, she has built brand names and campaigns for & quot;A&quot; list celebrities and major corporations. < br / > Specialties: Expertise in branding, marketing, promotion and multi - media strategies.Excellent with building 3 rd party and strategic alliances and promotions.Ability to communicate effectively across all management levels internally and externally.Proven track record in negotiating long term deals and managing multi - million dollar budgets.Successful in building and mentoring strong teams.Great with managing & quot;A&quot; list celebrities, senior level executives, clients and vendors.",
			"position": "Entertainment marketing and Branding"
		},
		{
			"name": "Miriam 'Mimi' Percell",
			"image": "MiriamP.jpg",
			"location": "Dallas, TX",
			"bio":
				"Miriam A. Percell, affectionately called “Mimi” is a Certified Neuromuscular Therapist and Spiritual Practitioner specializing in Healing Arts Therapy. She attended the Academy of Somatic Healing Arts (ASHA) and later completed her graduate courses at Gwinnett College of Massage Therapy. Mimi is owner of Be Well with Ease Studio a fledgling business located in Decatur, Georgia. Her core services include therapeutic massage, corporate onsite chair events and wellness communication services. She practices therapeutic, medical and spa therapies, wellness coaching, public speaking, Reiki Energy(touch, nontouch and distance) and meditation guided and training workshops.<br /> Mimi is a veteran strategic planning and program management professional. She began her career 25 years ago in New York developing programs for television, radio and advertising companies with an emphasis on social and environmental issues. Building upon lessons learned from those ventures, she founded Malvada Group, LLC a nationally recognized organization creating strategies and solutions for bridging communities and public/private entities together to help decision-makers and stakeholders establish policies that improve quality of life initiatives. <br /> In 2006 she faced a life changing crisis when her son was diagnosed with a mental illness. Her passion to serve communities transformed to advocating for her sons health and later helping other families facing the same challenges. She began to explore healing arts therapies to cope with the issues and later began practicing with her son. Her advocacy and desire to serve in the healing of her son and others struggling with mental health issues created a new pathway of serving communities. Mimi discovered she has a natural ability to bring ease, relaxation and healing to those she touches.<br /> Today Be Well services are being called on by surgeons, chiropractors, corporations, faith-based organizations and mental health agencies. In addition to mentoring young women, she conducts meditation and wellness coaching to provide young women tools o overcome and manage stress and adversities. Mimi's passion to serve in the healing of others is a rewarding and purposeful career. Although her journey to wellness was often a taxing experience, she has gained tremendous faith, courage and a healing gift that transforms and empowers lives. Mimi Percell resides in Atlanta, Georgia and has two adult children.",
			"position": "Vice Chair",
			"expertise":
				"Program Management and Strategic Management, Certified Neuromuscular Therapist and Spiritual Practicioner of Healing Arts"
		},
		{
			"name": "Annette Goodman",
			"image": "",
			"location": "Dallas, TX",
			"bio":
				"I was raised in Chesapeake, Virginia and I have spent most of my adult life in Charlotte, North Carolina. I have been in the teaching, facilitating arena for over 23 years and counseling for over 4 years. I have taught in Charlotte Mecklenburg School System as a Business Education Teacher. I was an Instructor at Statesville Community College, Central Piedmont Community College; also, my first stint was an Instructor at America Fashion Business Institute. I am currently employed as a Site Operations Coordinator with SkillStorm. I also am currently a Visiting Professor at DeVry University and an (online) Adjunct Professor with CTU Technical University. I recently was a Full Time Crisis Counselor II for Phoenix Counseling Center. I was also a Virtual Trainer for the Ravens Group assisting Government Employees seeking competitive employment. I have a MA in Professional Mental Health Counseling, an MS in Business Education and additionally, I hold a certificate as a (LCAS-A) Licensed Clinical Addictions Specialist Associate and (GCDF) Global Career Development Facilitator. I look forward to working with Save A Girl Save a Girl Foundation &quot;we shall make &quot;learning fun&quot;.",
			"position": ""
		},
		{
			"name": "Letetia Daniels Jackson",
			"image": "Letetia.jpg",
			"location": "Dallas, TX",
			"bio":
				"Letetia Daniels Jackson is President/CEO of Tandeka LLC, a limited liability corporation specializing in public policy advocacy, government relations, authentic community engagement, strategic planning and capacity building. In this role, Letetia serves as a consultant to the Robert Wood Johnson Foundation (RWJF), a member of the RWJF Culture of Health Prize Advisory Committee at the University of Wisconsin Population Health Institute and the RWJF/American Heart Association (AHA) Voices for Healthy Kid Evaluation Committee. She also serves as a consultant to the All* Above All Project.&#x3C;br /&#x3E;Letetia served as Program Director for the Groundswell Fund&#x2019;s Integrated Voter Engagement Project (IVE). Groundswell Fund supports a stronger, more effective U.S. movement for reproductive justice by mobilizing new funding and capacity-building resources to grassroots organizing and policy change efforts led by low-income women, women of color and transgender people. The IVE Program is an innovative approach to grassroots power building that blends community organizing with voter engagement in an ongoing and sustained way to boost the scale and power of grassroots organizations.&#x3C;br /&#x3E;Letetia served as the Project Director for development of The Advocacy Academy: A Policy Training Program on Childhood Obesity Prevention, funded by the Robert Wood Johnson Foundation (RWJF). The Pilot Program trained advocates in Alabama and Mississippi with a specific goal to promote development of a sustainable advocacy infrastructure in the South. Currently, the Advocacy Academy through Tandeka LLC provides advocacy training for myriad issues.&#x3C;br /&#x3E;Letetia served as a Technical Assistance Consultant (TAC) for the RWJF&#x2019;s Tobacco Policy Change Initiative (2007-2009) where she assisted grantees with successful policy advocacy efforts that included strategic planning, legislative strategy development and implementation, grassroots outreach, message development and communications. She was a TAC for capacity building to the National Coalition for Black Civic Participation (NCBCP) through Building Capacity Building Power Project, a Ford Foundation funded project. Letetia served as consultant to NCBCP&#x2019;s 2010 Decennial Census Unity Diaspora Coalition (UDC) and Unity Voter Empowerment Field Director. In this role, she developed NCBCP&#x2019;s 2010 Midterm Campaign Plan and managed the Census, Midterm Election and Redistricting Field Campaigns.&#x3C;br /&#x3E;Letetia served as Southern Region Director of Advocacy for Campaign for Tobacco Free Kids (TFK), (2000-2007). She worked with state and local tobacco control coalitions, voluntary organizations (AHA, ALA, and ACS), public health groups and advocates in nine states to encourage policy leaders to adopt comprehensive tobacco control policies. She was successful in facilitating the successful passage of tobacco policies in every state in the toughest region in the U.S. (Alabama, Arkansas, Georgia, Florida, Louisiana, Mississippi, Oklahoma, Tennessee, and Texas).&#x3C;br /&#x3E;In 2000, she served as campaign manager for first African-American mayor elected in Macon, GA. In 1998, Letetia served as Political Director for California Labor Federation, AFL-CIO where she managed the Federation&#x27;s successful internal campaign to defeat Proposition 226 (&#x22;Paycheck Protection&#x22; Initiative) and successful union mobilization campaign to support of Gray Davis for Governor, other statewide and state legislative candidates. She served as Lobbyist and Special Assistant to the Mayor and Chief Operating Officer for the City of Atlanta (1993-1997).&#x3C;br /&#x3E;Letetia serves on: Dothan Downtown Redevelopment Authority (Treasurer); Vice-President, past Executive Board Chair and President, Dothan Association of Women&#x2019;s Clubs, NCBCP&#x2019;s Black Women&#x2019;s Roundtable, and Les Vingt Socialete Club. A certified mentor at Hawk-Houston Boys and Girls Club and mentor/Board Member for Save a Girl, Save a World. &#x3C;br /&#x3E;Letetia holds a Bachelor&#x2019;s of Business Administration in Finance from Georgia State University. She is an active member of Dothan Community Church. Letetia is married to Michael B. Jackson and lives in Dothan, AL.",
			"position": ""
		},
		{
			"name": "Brooke Ellis",
			"image": "Brooke.jpg",
			"location": "Dallas, TX",
			"bio":
				"Recently honored at The Network Journal’s 40 under 40 Achievement Awards, marketing maven Brooke Ellis serves as diversity media manager for General Motors. She directs diversity media operations for all GM brands, including Chevrolet, Buick, Cadillac, GMC and OnStar. Ellis is responsible for overseeing multi-platform consumer media plans for the multicultural market while also managing diversity agency relationships. &quot;I work with them to help them understand and build their strategy for multicultural targets and then I identify media partners to leverage their creative material,&quot; Ellis says.<br />A graduate of Hampton University, the alum was motivated to pursue marketing through internships and mentors during her college career. &quot;When I was in school, I was selected to be an ambassador for MasterCard,&quot; Ellis says. &quot;Through that program, we learned about the marketing strategy for MasterCard, and we had to go back to our campuses and basically come up with a marketing campaign from start to finish. That allowed me to get my foot in the door, and I really enjoyed it. I knew that marketing was an area that I wanted to stay in.&quot;",
			"position": ""
		},
		{
			"name": "Constance Orlando",
			"image": "",
			"location": "Dallas, TX",
			"bio":
				"Constance M. Orlando is an award winning media executive recently named Head of Original Programming and Production at BET Networks, a unit of Viacom Inc.. A pop culture visionary, Ms. Orlando oversees all genres of original programming, including scripted offerings &#x201C;The Quad,&#x201D; &#x201C;Being Mary Jane,&#x201D; and specials including, Black Girls Rock! and ratings juggernaut BET Awards. Ms. Orlando also leads the BET News department, overseeing critically acclaimed specials on Ferguson and Baltimore. She also ushered BET into the documentary space with BET Truth Series, which in its inaugural year produced award winning projects Katrina 10 Years Later, Muhammad Ali: The People&#x2019;s Champ and Stay Woke.<br />Ms. Orlando previous roles with BET include Senior Vice President of Specials, Music Programming and News, and VP of Original Programming. Ms. Orlando was part of the network&#x2019;s largest expansion into original programming in its history. Her ability to lead, inspire and create hits resulted in a list of accomplishments including BET Presents: Love &#x26; Happiness, an Obama Celebration, Sunday Best, TD Jakes Presents: Mind, Body, &#x26; Soul, The Steve Harvey Project, Monica: Still Standing and scripted series The Game, which scored record-breaking ratings.<br />Ms. Orlando is Executive Producer of all tentpole events, including the BET Awards, the #1 program in cable television history among AA viewers and a top 10 awards show on television amongst total viewers. In 2010, Orlando successfully introduced brand-defining tentpole Black Girls Rock!, an unprecedented worldwide broadcast that celebrates outstanding black women. Previous honorees include Angela Davis, Ruby Dee, Misty Copeland and Ava DuVernay.<br />Prior to joining BET Networks, the Syracuse University graduate ran her own full service production company, CMO Productions, Inc. While running CMO, Orlando served as Executive Producer of award-winning director Hype Williams&#x2019; Big Dog Films. Among CMO&#x2019;s crowning triumphs was a partnership with music icon and businessman Jay-Z to produce the first of its kind, direct-to-video movie soundtrack The Streets Is Watching. <br />Outside of work, Orlando is passionate about advocating for and providing support to women and children in need, so in 1998 she launched a non-profit foundation, &#x2018;Just The Girls&#x2019;. She also serves on the Advisory Board for Clark Atlanta University&#x2019;s TV department as the Programming Committee Chair. Orlando accolades include NAMIC&#x2019;s &#x201C;Top 40 Under 40&#x201D;. Her work has earned her nine NAACP Image Awards (&#x201C;The Mo&#x2019;Nique Show&#x201D; 2010, &#x201C;Sunday Best&#x201D; 2011, &#x201C;Black Girls Rock!&#x201D; 2012/2013/2014/2016, &#x201C;The Game&#x201D; 2012, &#x22;Ali: The People&#x2019;s Champ&#x22; 2015, and Love &#x26; Happiness: an Obama celebration 2016), and five NAMIC Vision Awards (&#x201C;Black Girls Rock!&#x201D;).",
			"position": "BET Head of Original Programming"
		},
		{
			"name": "Crystal Williams",
			"image": "Crystal.jpg",
			"location": "Dallas, TX",
			"bio":
				"With over 25 years of experience in the public relations business and a family background in the radio broadcast industry, Crystal Williams has leveraged communications & #x27;expertise as owner of Crystal Vision Communications.As a marketing communications & #x27;      service, her team provides public relations counsel that drives desired business results.Her expertise includes: development of public relations brand strategies, event marketing concept creation mixed with traditional and social media outlets that grab the attention of the media and generate a & #x22;      buzz & #x22;      among consumers.Current / Past Clients include: General Motors, Toyota, Rainbow PUSH Automotive, CIG Developers, Urban Wheel Awards, Academy of Sacred Heart, MI - CEED, NAWBO Greater Detroit, Pontiac Meals On Wheels, just to name a few.",
			"position": "Marketing Communications and Public Relations"
		},
		{
			"name": "Julianne Marie Malveaux",
			"image": "Julianne.jpg",
			"location": "Dallas, TX",
			"bio":
				"Julianne Marie Malveaux (born September 22, 1953, in San Francisco, California) is an African-American economist, author, social and political commentator, and businesswoman. After five years as the 15th president of Bennett College, she resigned effective May 6, 2012. Malveaux entered Boston College after the 11th grade, and earned a B.A. and M.A. degrees in economics there in three years. While there, she was initiated in the Iota Chapter of Delta Sigma Theta sorority. She earned a Ph.D. in economics from MIT, and holds honorary degrees from Benedict College, Sojourner-Douglass College and the University of the District of Columbia.<br />As a writer and syndicated columnist, her work has appeared regularly in USA Today, Black Issues in Higher Education, Ms. magazine, Essence magazine, and The Progressive. Her weekly columns appear in numerous newspapers including the Los Angeles Times, the Charlotte Observer, the New Orleans Tribune, the Detroit Free Press, the San Francisco Examiner and the San Francisco Sun Reporter.<br />Malveaux has appeared regularly on CNN, BET, as well as on Howard University&#x27;s television show, Evening Exchange. She has appeared on PBS&#x27;s To The Contrary, KQED&#x27;s Forum, ABC&#x2019;s Politically Incorrect, Fox News Channel&#x27;s The O&#x27;Reilly Factor and stations such as C-SPAN, MSNBC and CNBC. She has also hosted talk radio programs in Washington, San Francisco, and New York, as well as a nationally broadcast, daily talk show that aired on the Pacifica Radio network from 1995 to 1996. She appeared on Black in America: Reclaiming the Dream hosted by Soledad O&#x27;Brien as a panelist on CNN in 2008.",
			"position": "Economist, Author, Social/Political Commentator and Businesswoman"
		},
		{
			"name": "Karin Brown",
			"image": "",
			"location": "Dallas, TX",
			"bio":
				"Karin Brown is an Educator. Her experience in public and private education, multileveled instruction as well as administration has spanned over three decades and continues to this day. In all aspects of her career and personal life, Karin has been concerned and involved with youth. During her instructional career, she received the honor of being recognized as one of Detroit&#x2019;s top educators by the Booker T. Washington Business Association. During her administrative years, she initiated her middle schools presence within the lucrative State acclaimed Michigan Youth and Government Program which introduced grades 5 - 8 to a real world government experience. As a result of their participation, many of the students upon entering high school were able to transfer to the Michigan Youth and Government High School Program and win executive positions, some went on to follow a political career.&#x3C;br /&#x3E;In her personal life Karin has always been involved with many private and civic organizations which provide student support programs, especially those that address the concerns of young girls and their place within this society. Karin has maintained many lasting mentor relationships with former students that have lasted to this day.&#x3C;br /&#x3E;As a dedicated member of Delta Sigma Theta Sorority, Incorporated, Karin continues to use her time and resources to assist in the uplift of young women to be aware of their self-worth and the prominence of their presence within the family and community.",
			"position": "Educator"
		},
		{
			"name": "Linda K. Brown",
			"image": "Linda.jpg",
			"location": "Dallas, TX",
			"bio":
				"Linda K. Brown, a game changer and innovator, is also an entrepreneur, professional public relations and media communications specialist, political campaign consultant, special event &#x26; conference planning coordinator and project management consultant. She has established a broad-based career for thirty years in various communications disciplines including: specialty marketing &#x26; advertising, public &#x26; media relations, event coordination, public involvement and community outreach, business development, image enhancement, film &#x26; video production and political campaign consulting. She is Founder &#x26; Chief Executive Officer of the Advantage Communications Group, LLC (A.C.G.), a full-service media communications agency.<br />She initially began her professional career in broadcast communications via the television industry at ABC Network, KTRK-TV in Houston where she worked for the iconic Consumer Advocate Marvin Zindler. Shortly after joining the News Dept. and because of her talent for strategic planning and organizing, she was promoted to Community Relations Director and became the first African American department head for the television network affiliate. Later in her career, she broadened her experience while working for various radio, television and cable networks including: KMJQ-FM Radio (Majic 102) in Houston; WATL-TV (Channel 36) in Atlanta as a Senior Account Executive; and later became Executive Vice-President &#x26; General Manager for Black Entertainment Television (BET-Sable Communications) where she launched their successful southern regional sales office in Atlanta. As a change agent, Brown made a significant impact upon the necessity for diversity within the broadcasting industry during her tenure.<br />ACG services many corporate clients by reaching their targeted markets; assists small and minority businesses with the development and execution of their business marketing plans; assists governmental and corporate clients with their public involvement and community outreach goals; and consults with many notable national and regional candidates &#x26; elected officials seeking political office. The agency allows for versatility and adaptability to clientele needs which is evidenced by their involvement with their broad-based local &#x26; national clients and projects.<br />A partial listing of their corporate management &#x26; consulting projects have included: Montgomery Watson Harza Global; Shell Oil Co.; Toyota, Russell Simmons&#x2019; Hip-Hop Summit; Tavis Smiley Foundation &#x201C;Youth 2 Leaders&#x201D; Conference; Donna Brazile &#x26; Associates; Rainbow/PUSH Coalition; METRO Solutions Project; National Black Chamber of Commerce, Wendy&#x2019;s Corporation; PRIDE Restaurants; United National Insurance Agency; Aetna Financial Services; Browning-Ferris Industries (BFI); Black Entertainment Television (BET); Burrell Communications &#x201C;Weight Watchers Program&#x201D;; Morehouse School of Medicine; The Nielsen Company; Tennessee Managed Care Network; Congressional Black Caucus Foundation (CBCF); Harris County Sports Authority; The Ensemble Theatre; Post Properties; The Parsons Company; 100 Black Men of America; The Washington Group; The Kingdombuilders&#x2019; Leader&#x2019;s Academy; Victory Preparatory School and others.<br />Ms. Brown&#x2019;s political involvement is as extensive having worked with numerous local and national elected officials and campaigns where she has served as Political Campaign Consultant and/or Communications Director including: Hillary Clinton for President Campaign; Jesse Jackson for President Campaigns; the late Congressman Mickey Leland (TX); former U. S. Senator Carol Moseley Braun (IL); U. S. Congresswoman Sheila Jackson Lee (TX); former U. S. Congressman Jesse Jackson, Jr. (IL); former Mayor Andrew Young (Atlanta); Houston Mayor Sylvester Turner; former Houston Mayor Lee P. Brown; City Councilmember Larry Green; City Councilmember Dwight Boykins; James Dixon for City Council Campaign; former City Councilmember John Peavy, Jr.; former State Rep. Al Edwards; former City Councilmember Jew Don Boney (Houston); Laurie Robinson for City Council Campaign (Houston); Bill Bowen for Congress (Ohio); Jesse Spikes for Mayor Campaign (Atlanta) among others.<br />She has worked extensively with numerous national projects in conjunction with civil rights organizations including the 30th Anniversary &#x201C;March on Washington&#x201D; (1993); the NAACP &#x2018;Get-Out-The-Vote&#x2019; Freedom Ride; National Rainbow/PUSH Coalition&#x2019;s &#x2018;Southern Voting Rights Tour&#x2019;; 1st Annual African American Leadership Summit (Baltimore); the historic &#x201C;Million Man March&#x201D; held in Washington, D.C. (1995) and the 2004 Russell Simmons &#x201C;Hip-Hop Summit&#x201D; held Super Bowl weekend in Houston. She also served as National Press Secretary/Communications Director for the Rev. Jesse L. Jackson and the National Rainbow/PUSH Coalition as well as Dr. Benjamin F. Chavis during his tenure as President/CEO of the NAACP in 1993-94. Also as a passionately committed volunteer, she serves in many capacities including: Treasurer of Save A Girl-Save A World national girl&#x2019;s mentoring program; Board Member of the Midtown Redevelopment Authority, Regional Director for the Leadership Texas Alumni Association Board of Directors, Advisory Board Member of Project W.A.V.E, member of 100 Black Men of America Advisory Committee, member of American Women in Radio &#x26; TV (AWRT), Women in Communications, Inc. (WICI), National Association of Market Developers (NAMD), and Board Member of the City of Houston&#x2019;s Keep Houston Beautiful Commission to name a few. She currently serves on the Mayor&#x2019;s Independent Police Oversight Board (IPOB). She has received many distinguished awards including: YWCA Outstanding Business Leader; River Oaks Democratic Women Outstanding Woman of the Year; Who&#x2019;s Who of National Professional &#x26; Business Women, Who&#x2019;s Who in Black Houston, National Association of Professional Women, Outstanding Young Women of America and African American Business Achievement Pinnacle Award honoree.",
			"position": "Entrepreneur & Public Relations Specialist"
		},
		{
			"name": "Machelle D. Williams",
			"image": "Machelle.jpg",
			"location": "Dallas, TX",
			"bio":
				"Machelle Williams has 23 years of experience in the Volkswagen Group of America.&#x3C;br /&#x3E; Offering a blend of strategic and operational strengths, Machelle has worked to align the company&#x2019;s diversity and corporate giving strategies with overall corporate objectives. During her tenure she has implemented initiatives that impact employee engagement and represent VWGoA&#x2019;s commitment to serve the communities where they operate. Under her leadership VWGoA has been recognized by DiversityINC as a Top 25 Noteworthy Company and as a Best Place to Work by the Human Rights Campaign achieving a 100% score on the Corporate Equality Index. In 2017 she was recognized by the Network Journal as one of the 25 influential black women in Business. In 2014, The Rainbow Push Coalition honored her as an &#x201C;Emerging Leader,&#x201D; and in 2012 she was recognized as &#x201C;Woman of the Year&#x201D; by the National Association of Minority Automobile Dealers. She was also named by Savoy Magazine as one of the most influential women in corporate America. She currently serves as the Chair of the INROADS Mid Atlantic Regional Board, and is on the Board of the Urban League of Greater Chattanooga. Machelle received her B.A. from Drake University, where she majored in Magazine Journalism. She is the founder of Machelle&#x2019;sVoice, an audio book narration business, and is the proud pet parent of two Boston Terriers Daphne and Lilah.",
			"position": "Sr. Director of Diversity & Corporate Social Responsibility"
		}
	]
}
